[LGSI 개발 관리]

현황

장치 종류

성공

실패

총합



실외기

3

4

7



실내기

12

25

37



환기

4

18

22



dokit

1

1

1



do

1

1

1



공청기

6

3

9



시스템보일러

      



6

확인 중



=> 실패하는 tc 에 대해서 팔로우업 할 예정입니다.



사실 LGSI개발에 대한 action plan을 정하기가 어려워 전달이 늦어졌던 것 같습니다.

기본적으로 장치/제어모니터링에서 지연이 발생했던 것은 빌드 전달전에 LGSI가 기본적인 검증을 해주지 않아 동일한 문제를 재테스트/재보고 하는데 시간이 소요되었고, 제어/모니터링을 최근에서야 드제이 및 다른 SI 인원이 개발을 담당했지만 약 2달간은 VK 가 주로 개발했었기에 해당 문제가 개선되지 않았습니다. 이러한 문제에 대해서, jira 댓글이나, 팀즈를 통해 거듭 잘못되었다고 말을 했었지만 크게 달라지는 것은 없었습니다. 

 

그 속에서 제가 할 수 있었던게 해당 이슈로 막히지 않은 다른 장치 및 기능 테스트를 병행하여 빠르게 이슈 리포트를 했고, 초반에는 요구사항이 구체적이지 않아 개발이 부진할 수도 있을 것 같다고 판단하여 관련 가이드 문서를 전달하기도 하였으나 확실하게 만회되지는 않았습니다.





우리 프로젝트가 지연되고 있는데.. 그래서 앞으로의 to do list,그리고 앞으로는 그런 일이 발생하지 않도록 나는 어떤 거를 할건지 적어서 내야해.
근데 난 솔직히 다 해본 것 같은데.. 얼마큼 다 해봤는지 적으려고. 쟤네 팀장한테 말하기도했고.... 같은 이슈를 3번 이상 리포트 한적도 있고, 현재 한국 개발자들이 장치/제어 모니터링에서 맡고 있는 작업들이, vk 한테 리포트 하였으나 고치지 않아서 그냥 내가 포기하고 놔둔것 들이야. 그래서 아직 기본적인 idu 장치도 개발 완료 되지 않은 거고

그리고 혹시나 너가 생각하기에 추가적인 계획이 있다면 알려줘.





