지식 확산과 협업 기반 강화 부분에 조금 더 중점적으로 작성을 하고 싶어. 

일단 증거 자료로 내가 콜랩 문서 정리한거랑, 발표 자료를 첨부할 거고.. 
이거를 준비하면서 내가 webos에 자체에 대해서 내부 동작이 어떻게 되는지, 그리고 b2b 플랫폼 자체가 왜 필요한지를 상세히 알린거고 ... 

cto분들이랑은 매주 싱크업 회의를 통해 문제 사항을 알리고 지원요청을 받거나 했어. 예를 들어 저기에 적은 wifi 이슈도 내가 리포트 함으로써 cto 쪽에서 webos 의 문제 기능을 인지하고 후속처리해줬고, 그 외에도 일부 luna-api 의 작동방식이나, 그런 사소한 질문들을 하면서 정말 webos 자체에 가까워지는 한해였어. 
factory Reset 공통 시나리오 구현은 webos 측면에서 제공되는 기능이었지만, 내가 우리 b2b 플랫폼에 맞게 수정을 했어. 즉 cto 에서 개발한 webos 는 기본적인 factory reset 기능을 제공했는데, 우리 es 사업부의 중앙 제어기 관점에 맞게 수정을 한거지.
