주간 업무 전달드립니다.
현장에서 가장 많이 사용될 실내기 기능을 우선적으로  가이드 전달하였고, 실내기에서 일부 기능제외 정상 동작하는 것을 확인하였습니다. 
 

실내기(~7/9) 

모든 제어 동작은 확인하였으나, 일부 기능에서 다소 미흡한 부분 발견하여 추가 가이드 전달한 상태입니다. 
 완료 보고를 받았긴 하나 확인이 필요합니다. 

단독 공기청정 및 인체 감지 기능이 off 되어있음에도 필드가 생성되는 현상
추가로, uv 제어 나 협조 제어 관련한 아이콘은 아직 없어, 아이콘이 제작되면 바로 적용할 수 있도록 개발요청하였고, 디자인 쪽에 추가 아이콘 요청드렸습니다. 
관련 이슈 링크 : http://jira.lge.com/issue/projects/NETGUIAI/issues/NETGUIAI-205?filter=reportedbyme
 
실외기 (~7/10) 

실외기 제어가 되지 않아 관련 이슈 다시 정리하여  si 측에 이슈 보고 한 상태입니다.
관련 이슈 링크: http://jira.lge.com/issue/projects/NETGUIAI/issues/NETGUIAI-178?filter=reportedbyme

+ 명확한 가이드와.. 데모를 통해 확인을하더라도 실제 개발에 제대로 반영이 되지 않은 것들이 많았습니다. 머지 이후 런쳐앱을 통해 확인하는데까지 걸리는 시간을 줄이기 위해 직접 빌드하여 확인할 수 있도록 환경 세팅하였습니다. 금일부터는 바로 머지하여 테스트 할 수 있도록 하겠습니다.



추가로 wifi 실패 이슈 관련하여, 상 책임님께 말씀드려서 시료 5개 확보 하였고, 금일 오후에 시료 세팅 예정입니다.
